{
    "name": "Massimo Siboldi",
    "jobTitle": "Software Engineer, Front-End Web Developer",
    "phone": "+1.650.996.3443",
    "email": "mdsiboldi@gmail.com",
    "website": "massimo.siboldi.com",
    "github": "github.com/mdsib",
    "main": [
        {
            "name": "Work Experience",
            "entries": [
                {
                    "name": "Disqus",
                    "role": "Javascript Engineer",
                    "when": "2016",
                    "descriptions": [
                        "Used vanilla javascript, React, Redux, and backbone to improve commenting for millions of users.",
                        "As part of a cross-functional agile team, architected, implemented, and iterated on various features, with the goal of improving Disqus' publisher satisfaction. Projects included publisher registration flow, moderation tools, and publisher analytics.",
                        "Worked on initial transition of the admin site's state management to Redux."
                    ]
                },
                {
                    "name": "Magnifi",
                    "role": "Software Engineer",
                    "when": "2015 - 2016",
                    "descriptions": [
                        "Developed client-side features using Ember.js, ES6, Sass, and Handlebars to help music-lovers discover musicians playing near them.",
                        "Worked with an A/B testing framework to make effective changes to Magnifi's registration page.",
                        "Used test driven development on Magnifi's Rails backend to work on event ingestion.",
                        "Integrated client-side app with API-based CMS (Prismic) to meet marketing demands to quickly generate promotional pages."
                    ]
                },
                {
                    "name": "Music Putty",
                    "role": "Co-Founder, Lead Developer",
                    "when": "2013 - 2015",
                    "descriptions": [
                        "Built client and server applications from the ground up for a music-focused web app. This web app helped independent musicians to gain exposure and revenue through crowdfunding, donations, and free streaming.",
                        "Led a small team of engineers, helping to grow management, communication, and interdisciplinary skills."
                    ]
                }
            ]
        }, {
            "name": "Projects",
            "entries": [
                {
                    "name": "Synthing",
                    "when": "2017 - 2018, work in progress",
                    "descriptions": [
                        "Developing a wavetable synthesizer for the browser, using the canvas and web audio APIs, designed to visually explore and manipulate waveforms.",
                        "Technologies used: Webpack, preact, redux, babel."
                    ]
                },
                {
                    "name": "FreeSound Synth",
                    "when": "2014",
                    "descriptions": [
                        "Developed a web-based synthesizer, using sounds in the public domain to create soundscapes using granular synthesis techniques."
                    ]
                }
            ]
        }
    ],
    "aside": [
        {
            "name": "Education",
            "entries": [
                {
                    "name": "California Polytechnic State University, San Luis Opispo",
                    "when": "2010 - 2015",
                    "descriptions": [
                        "Interdisciplinary B.A. in Computer Science and Music through LAES."
                    ]
                }
            ]
        },
        {
            "name": "Skills",
            "entries": [
                {
                    "name": "Languages",
                    "descriptions": [
                        "Expertise in Javscript / ES6, HTML5, CSS3, Sass, Less.",
                        "Learning and interested in Node, Python, Ruby, Perl, Clojure, and Scheme."
                    ]
                },
                {
                    "name": "Javascript Frameworks & Libraries",
                    "descriptions": [
                        "React, Preact, Redux, web components, Ember.js, lodash / underscore, jQuery"
                    ]
                },
                {
                    "name": "Technologies & Programs",
                    "descriptions": [
                        "Linux, Command Line Tools (CLI), Git (Github, Gitlab, BitBucket, Phabricator), AWS, Heroku, Emacs, Vim, Vagrant, Adobe Creative Suite and similar digital design tools"
                    ]
                }
            ]
        }
    ]
}
